a = [0, -8, 6, -8, 5]  # нижняя диагональ
b = [-6, 10, 18, 17, 14]  # главная диагональ
c = [-1, 1, 6, -5, 0]  # верхняя диагональ
d = [30, -31, 108, -114, 124]  # вектор правой части
n = len(d)
# Прямой ход
for i in range(1, n):
    m = a[i] / b[i - 1]
    b[i] = b[i] - m * c[i - 1]
    d[i] = d[i] - m * d[i - 1]
# Обратный ход
x = [0] * n
x[-1] = d[-1] / b[-1]

for i in range(n - 2, -1, -1):
    x[i] = (d[i] - c[i] * x[i + 1]) / b[i]

print("Решение системы линейных алгебраических уравнений методом прогонки:", x)
